# На площадката пред жилищен блок трябва да се поставят плочки.
# Площадката е с форма на квадрат със страна N метра. Плочките са широки „W“
# метра и дълги „L“ метра. На площадката има една пейка с ширина M метра и
# дължина O метра. Под нея не е нужно да се слагат плочки. Всяка плочка се
# поставя за 0.2 минути.

# Напишете програма, която чете от конзолата размерите на площадката, плочките
# и пейката и пресмята колко плочки са необходими да се покрие площадката и
# пресмята времето за поставяне на всички плочки.

n_area = float(input())  # размерите на площадката в м
w_block = float(input())    # ширина на плочка в м
l_block = float(input())    # дължина на плочка в м
m_table = float(input())    # ширина на пейка в м
o_table = float(input())    # дължина на пейка в м

full_area = n_area**2
table_area = m_table * o_table
block_area = full_area - table_area
block_1 = w_block * l_block
num_block = block_area / block_1
time_block = num_block * 0.2

print(num_block)
print(time_block)

