# Преди време Пешо си е купил биткойни.
# Сега ще ходи на екскурзия из Европа и ще му трябва евро.
# Освен биткойни има и китайски юани.
# Пешо иска да обмени парите си в евро за екскурзията.
# Напишете програма, която да пресмята колко евро може да купи спрямо
# следните валутни курсове:

# 1 биткойн = 1168 лева.
# 1 китайски юан = 0.15 долара.
# 1 долар = 1.76 лева.
# 1 евро = 1.95 лева.
# Обменното бюро има комисионна от 0 до 5 процента от крайната сума в евро

bitkoin = float(input())
uan = float(input())
commision = float(input())


eur_bit = (bitkoin * 1168)/1.95
eur_uan = ((uan * 0.15)*1.76)/1.95
result = eur_bit + eur_uan - (eur_bit + eur_uan)*commision/100

print('%.2f' % result)


